trade/src/Documents/ИмпортПродукцииСАТУРН/ИмпортПродукцииСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИмпортПродукцииСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.МестаХраненияПартийСАТУРН</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийСАТУРН</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеИмпортПродукцииСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаЭкспортер</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.КлассификаторТранспортныхСредствСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТНАРГУС</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>DefinedType.ТранспортныеСредстваИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПункт</name>
    <type>
      <types>CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальноеУправление</name>
    <type>
      <types>CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПеревозчик</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмпортируемаяПартия</name>
      <type>
        <types>CatalogRef.ИмпортируемаяПартияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/InformationRegisters/СтатусыОформленияДокументовСАТУРН/СтатусыОформленияДокументовСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОформленияДокументовСАТУРН</name>
  <resources>
    <name>СтатусОформления</name>
    <type>
      <types>EnumRef.СтатусыОформленияДокументовГосИС</types>
    </type>
  </resources>
  <resources>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыСАТУРНПоддерживающиеСтатусыОформления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСтатусыОформленияДокументовСАТУРН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/ДальнейшиеДействияПоВзаимодействиюСАТУРН/ДальнейшиеДействияПоВзаимодействиюСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДальнейшиеДействияПоВзаимодействиюСАТУРН</name>
  <enumValues>
    <name>АннулируйтеОперацию</name>
  </enumValues>
  <enumValues>
    <name>ВернитеНакладную</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитеОбмен</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузитеПартииИмпорта</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузитеКлассификатор</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеЗавершенияОбработкиДанных</name>
  </enumValues>
  <enumValues>
    <name>ОжидайтеПередачуДанныхРегламентнымЗаданием</name>
  </enumValues>
  <enumValues>
    <name>ОтклонитеЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеОперацию</name>
  </enumValues>
  <enumValues>
    <name>ОтменитеПередачуДанных</name>
  </enumValues>
  <enumValues>
    <name>ОтменитьВвоз</name>
  </enumValues>
  <enumValues>
    <name>ОформитеОтгрузкуИмпортаИзЕЭАС</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеДанные</name>
  </enumValues>
  <enumValues>
    <name>ПередайтеНаДосмотр</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеВозврат</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеВозвратЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеНакладную</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюГруза</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюПриВозврате</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтерюПриВозвратеЧастично</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеУтилизацию</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитеЭкспорт</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СтатусыОформленияДокументовГосИС/СтатусыОформленияДокументовГосИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОформленияДокументовГосИС</name>
  <enumValues>
    <name>НеОформлено</name>
  </enumValues>
  <enumValues>
    <name>ОформленоЧастично</name>
  </enumValues>
  <enumValues>
    <name>Оформлено</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяСопоставлениеНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ЕстьОшибкиОформления</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/КлассификаторОрганизацийСАТУРН/КлассификаторОрганизацийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторОрганизацийСАТУРН</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиКонтрагентовСАТУРН</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаХранения</name>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХраненияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыйОбъект</name>
      <type>
        <types>DefinedType.ТорговыйОбъектСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственныйОбъект</name>
      <type>
        <types>DefinedType.ПроизводственныйОбъектИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МестаПрименения</name>
    <attributes>
      <name>МестоПрименения</name>
      <type>
        <types>CatalogRef.МестаПримененияСАТУРН</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>DefinedType.ПользователиИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Documents/ИмпортПродукцииСАТУРН/Forms/ФормаСпискаДокументов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	УстановитьБыстрыйОтборСервер();
	СобытияФормСАТУРН.ПриСозданииНаСервереФормыСпискаДокументов(ЭтотОбъект);

	ИнтеграцияСАТУРН.ЗаполнитьСписокВыбораДальнейшееДействие(
		Элементы.СтраницаОформленоОтборДальнейшееДействие.СписокВыбора, ВсеТребующиеДействия(), ВсеТребующиеОжидания());
	
	УстановитьВидимостьТаблицыКОформлению();
	НастроитьВидимостьДоступностьЭлементовСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);

	ОбщегоНазначенияИС.УстановитьПризнакПравоИзмененияФормыСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ИмпортируемаяПартияСАТУРН" Тогда
		
		Элементы.СписокКОформлению.Обновить();
		Элементы.СписокПоТоварнымНакладным.Обновить();
		
	КонецЕсли;
	
	ОбменДаннымиИСКлиент.ОбработкаОповещенияВФормеСпискаДокументовИС(
		ЭтотОбъект,
		ИнтеграцияСАТУРНКлиентСервер.ИмяПодсистемы(),
		ИмяСобытия,
		Параметр,
		Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ОтборПоОрганизации

&НаКлиенте
Процедура ОформленоОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленоОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленоОрганизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Истина, Истина, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленоОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Истина, Истина, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленоОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Истина, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОформленоОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Истина, "Оформлено");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "КОформлению");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОткрытьФормуВыбораОрганизаций(ЭтотОбъект, "КОформлению");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Истина, Истина, "КОформлению");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, Истина, Истина, "КОформлению");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Истина, "КОформлению");
	
КонецПроцедуры

&НаКлиенте
Процедура КОформлениюОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияСАТУРНКлиент.ОбработатьВыборОрганизаций(ЭтотОбъект, ВыбранноеЗначение, Истина, "КОформлению");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СтраницаОформленоОтборСтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Статус", Статус, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОформленоОтборДальнейшееДействиеПриИзменении(Элемент)
	
	УстановитьОтборПоДальнейшемуДействиюСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаОформленоОтборОтветственныйПриИзменении(Элемент)
	
	ОтветственныйОтборПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТТНПродукцияПриИзменении(Элемент)
	
	УстановитьВидимостьТаблицыКОформлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ТТНПродукцияПоДокументамПриИзменении(Элемент)

	УстановитьВидимостьТаблицыКОформлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКОформлению

&НаКлиенте
Процедура СписокКОформлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.СписокКОформлению.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокКОформлениюПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТаблицаСопоставлений = ИнтеграцияСАТУРН.НоваяТаблицаОрганизацияКонтрагент();
	
	Для Каждого СтрокаДинамическогоСписка Из Строки Цикл
		
		ДанныеСтроки = СтрокаДинамическогоСписка.Значение.Данные;
		
		Если Не ДанныеСтроки.ТипДокумента = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.ОрганизацияСАТУРН) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСопоставленияОрганизация = ИнтеграцияСАТУРН.ДобавитьВТаблицуОтбораСопоставлений(
			ТаблицаСопоставлений, ДанныеСтроки.Организация);
		
	КонецЦикла;
	
	Справочники.КлассификаторОрганизацийСАТУРН.ЗаполнитьТаблицуСопоставленийКлассификаторамиСАТУРН(ТаблицаСопоставлений);
	
	Для Каждого СтрокаДинамическогоСписка Из Строки Цикл
		
		ДанныеСтроки             = СтрокаДинамическогоСписка.Значение.Данные;
		ОформлениеСтроки         = СтрокаДинамическогоСписка.Значение.Оформление;
		ШаблонСтроки             = НСтр("ru = '%1 (%2)'");
		ПредставлениеОрганизации = "";
		
		Если ДанныеСтроки.ТипДокумента = 0 Тогда
			
			Если ЗначениеЗаполнено(ДанныеСтроки.Организация) Тогда
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, ДанныеСтроки.ОрганизацияСАТУРН, ДанныеСтроки.Организация);
			Иначе
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, ДанныеСтроки.ОрганизацияСАТУРН, "<не сопоставлено>");
				ОформлениеСтроки["ПредставлениеОрганизации"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
			КонецЕсли;
			
		Иначе
			
			СтруктураПоиска = Новый Структура("ОрганизацияКонтрагент", ДанныеСтроки.Организация);
			СтрокиСопоставлений = ТаблицаСопоставлений.НайтиСтроки(СтруктураПоиска);
			
			Если СтрокиСопоставлений.Количество() = 0 Тогда
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, "<не сопоставлено>", ДанныеСтроки.Организация);
				ОформлениеСтроки["ПредставлениеОрганизации"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
			ИначеЕсли СтрокиСопоставлений.Количество() = 1 И ЗначениеЗаполнено(СтрокиСопоставлений[0].ОрганизацияСАТУРН) Тогда
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, СтрокиСопоставлений[0].ОрганизацияСАТУРН, ДанныеСтроки.Организация);
			ИначеЕсли СтрокиСопоставлений.Количество() = 1 Тогда
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, "<не сопоставлено>", ДанныеСтроки.Организация);
				ОформлениеСтроки["ПредставлениеОрганизации"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
			Иначе
				ПредставлениеМножественногоСопоставления = СтрШаблон(НСтр("ru = '%1 ( + еще %2'"), СтрокиСопоставлений[0].ОрганизацияСАТУРН, СтрокиСопоставлений.Количество() - 1);
				ПредставлениеОрганизации = СтрШаблон(ШаблонСтроки, ПредставлениеМножественногоСопоставления, ДанныеСтроки.Организация);
				ОформлениеСтроки["ПредставлениеОрганизации"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеСтроки.ПредставлениеОрганизации = ПредставлениеОрганизации;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ИнтеграцияСАТУРНКлиент.ВыполнитьОбмен(
		ЭтотОбъект,
		ИнтеграцияСАТУРНКлиент.ОрганизацииДляОбмена(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Оформить(Команда)
	
	ОчиститьСообщения();
	КлючиВыделенныхСтрок = Новый Массив;
	Основание            = Новый Массив;
	
	Если ТТНПродукция = 0 Тогда
		
		Если Не ОбщегоНазначенияИСКлиент.ВыборСтрокиСпискаКорректен(Элементы.СписокКОформлению) Тогда
			Возврат;
		КонецЕсли;
	
		Для Каждого ИдентификаторСтроки Из Элементы.СписокКОформлению.ВыделенныеСтроки Цикл
			
			КлючиВыделенныхСтрок.Добавить(ИдентификаторСтроки);
			
		КонецЦикла;
		
		РезультатПроверки = ВозможностьВводаПогашенияИмпортаПродукции(КлючиВыделенныхСтрок);
		
		Если НЕ РезультатПроверки.РазрешенВвод Тогда
			Возврат;
		КонецЕсли;
		
		Основание = РезультатПроверки.Основание;
		
	Иначе
		
		Если Не ОбщегоНазначенияИСКлиент.ВыборСтрокиСпискаКорректен(Элементы.СписокПоТоварнымНакладным) Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.СписокПоТоварнымНакладным.ТекущиеДанные;
		Основание = СписокИмпортируемыхПартийПоОтбору(ТекущиеДанные.ОрганизацияСАТУРН, ТекущиеДанные.МестоХранения, ТекущиеДанные.ДатаВвоза);
		
		Если Основание.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр( "ru = 'Нет данных для заполнения'"),, "СписокПоТоварнымНакладным");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИнтеграцияСАТУРНКлиент.ОткрытьФормуСозданияДокумента(
		ОбщегоНазначенияИСКлиентСервер.ИмяОбъектаИзИмениФормы(ЭтотОбъект),
		Основание,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Архивировать(Команда)
	
	ИнтеграцияИСКлиент.АрхивироватьРаспоряжения(ЭтотОбъект, Элементы.СписокКОформлению, ИнтеграцияСАТУРНКлиент,
		ПредопределенноеЗначение("Документ.ИмпортПродукцииСАТУРН.ПустаяСсылка"), "Ссылка");
	
КонецПроцедуры

&НаКлиенте
Процедура АрхивироватьДокументы(Команда)
	
	ОбщегоНазначенияИСКлиент.АрхивироватьДокументы(ЭтотОбъект, Элементы.Список, ИнтеграцияСАТУРНКлиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИмпорт(Команда)
	
	ИнтеграцияСАТУРНКлиент.ПодготовитьСообщенияКПередаче(
		Элементы.Список, ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюСАТУРН.ПодтвердитеИмпорт"));

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВвоз(Команда)
	
	ИнтеграцияСАТУРНКлиент.ПодготовитьСообщенияКПередаче(
		Элементы.Список, ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюСАТУРН.ОтменитьВвоз"));

КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанные(Команда)
	
	ИнтеграцияСАТУРНКлиент.ПодготовитьСообщенияКПередаче(
		Элементы.Список, ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюСАТУРН.ПередайтеДанные"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьИмпорт(Команда)
	
	ЗапросИмпортаЗавершение = Новый ОписаниеОповещения("Подключаемый_ЗапросИмпортаЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ОрганизацияСАТУРН) Тогда
		ПараметрыФормы.Вставить("Организация", ОрганизацияСАТУРН);
	КонецЕсли;
	
	ОткрытьФорму(
		"Документ.ИмпортПродукцииСАТУРН.Форма.ЗапросИмпортируемыхПартий",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ЗапросИмпортаЗавершение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументИмпортаИзЕАЭС(Команда)
	
	ОчиститьСообщения();
	
	РеквизитыЗаполнения = Новый Структура("Операция", ПредопределенноеЗначение("Перечисление.ВидыОперацийСАТУРН.ИмпортПродукцииИзЕАЭС"));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", РеквизитыЗаполнения);
	ПолноеИмяДокумента = ОбщегоНазначенияИСКлиентСервер.ИмяОбъектаИзИмениФормы(ЭтотОбъект);
	
	ОткрытьФорму(
		ПолноеИмяДокумента + ".Форма.ФормаДокумента",
		ПараметрыФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПредварительногоУведомления(Команда)
	
	ОчиститьСообщения();
	
	РеквизитыЗаполнения = Новый Структура("Операция", ПредопределенноеЗначение("Перечисление.ВидыОперацийСАТУРН.ИмпортПродукцииПредварительноеУведомление"));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", РеквизитыЗаполнения);
	ПолноеИмяДокумента = ОбщегоНазначенияИСКлиентСервер.ИмяОбъектаИзИмениФормы(ЭтотОбъект);
	
	ОткрытьФорму(
		ПолноеИмяДокумента + ".Форма.ФормаДокумента",
		ПараметрыФормы);
	
КонецПроцедуры

#Область ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

//@skip-warning
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Ошибки
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.Статус.ПутьКДанным);
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.ЗагрузитьЗначения(Документы.ИмпортПродукцииСАТУРН.СтатусыОшибок());
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС);
	
	// Требуется ожидание
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ДальнейшееДействие.ПутьКДанным);
	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.ЗагрузитьЗначения(Документы.ИмпортПродукцииСАТУРН.ВсеТребующиеОжидания()); 
	ОтборЭлемента.ПравоеЗначение = СписокДействий;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СтатусОбработкиПередаетсяГосИС);
	
	// Даты
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьТаблицыКОформлению()
	
	Если ТТНПродукция Тогда
		Элементы.СписокПоТоварнымНакладным.Видимость                          = Истина;
		Элементы.СписокПоДокументамКОформлениюКоманднаяПанельГруппа.Видимость = Истина;
		Элементы.СписокКОформлению.Видимость                                  = Ложь;
		Элементы.СписокКОформлениюКоманднаяПанельГруппа.Видимость             = Ложь;
	Иначе 
		Элементы.СписокПоТоварнымНакладным.Видимость                          = Ложь;
		Элементы.СписокПоДокументамКОформлениюКоманднаяПанельГруппа.Видимость = Ложь;
		Элементы.СписокКОформлению.Видимость                                  = Истина;
		Элементы.СписокКОформлениюКоманднаяПанельГруппа.Видимость             = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапросИмпортаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.СписокКОформлению.Обновить();
	
КонецПроцедуры

#Область ОтборДальнейшиеДействия

&НаСервереБезКонтекста
Функция ВсеТребующиеДействия()
	
	Возврат Документы.ИмпортПродукцииСАТУРН.ВсеТребующиеДействия();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВсеТребующиеОжидания()
	
	Возврат Документы.ИмпортПродукцииСАТУРН.ВсеТребующиеОжидания();
	
КонецФункции

&НаСервере
Процедура УстановитьОтборПоДальнейшемуДействиюСервер()
	
	ИнтеграцияСАТУРН.УстановитьОтборПоДальнейшемуДействию(
		Список, ДальнейшееДействие, ВсеТребующиеДействия(), ВсеТребующиеОжидания());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБыстрыйОтборСервер()
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если СтруктураБыстрогоОтбора <> Неопределено Тогда
		
		СтруктураБыстрогоОтбора.Свойство("ОрганизацииСАТУРН",              ОрганизацииСАТУРН);
		СтруктураБыстрогоОтбора.Свойство("ОрганизацияСАТУРН",              ОрганизацияСАТУРН);
		СтруктураБыстрогоОтбора.Свойство("ОрганизацииСАТУРНПредставление", ОрганизацииСАТУРНПредставление);
		
		ИнтеграцияСАТУРНКлиентСервер.УстановитьОтборыДинамическогоСпискаПоОрганизацииСАТУРН(ЭтотОбъект);
		
		ИнтеграцияИС.ОтборПоЗначениюСпискаПриСозданииНаСервере(Список, "Ответственный", Ответственный, СтруктураБыстрогоОтбора);
		
	КонецЕсли;
	
	СобытияФормСАТУРН.ЗаполнитьСписокВыбораОрганизацииПоСохраненнымНастройкам(ЭтотОбъект);
	
	Если ИнтеграцияСАТУРН.НеобходимОтборПоДальнейшемуДействиюПриСозданииНаСервере(ДальнейшееДействие, СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоДальнейшемуДействиюСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьДоступностьЭлементовСервер()
	
	Если НЕ ПравоДоступа("Добавление", Метаданные.Документы.ИмпортПродукцииСАТУРН) Тогда
		Элементы.СтраницаКОформлению.Видимость = Ложь;
	ИначеЕсли Параметры.ОткрытьРаспоряжения Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКОформлению;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()

	ИнтеграцияСАТУРНСлужебныйКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйОтборПриИзменении()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Ответственный", Ответственный, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Ответственный));
	
КонецПроцедуры

&НаКлиенте
Функция ВозможностьВводаПогашенияИмпортаПродукции(Знач ВыделенныеСтроки)
	
	РезультатПроверки = Новый Структура("РазрешенВвод, Основание", Ложь, Неопределено);
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат РезультатПроверки;
	ИначеЕсли ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат РезультатПроверки;
	ИначеЕсли ВыделенныеСтроки.Количество() = 1 Тогда
		
		ТекущиеДанные = Элементы.СписокКОформлению.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат РезультатПроверки;
		КонецЕсли;
		
		РезультатПроверки.РазрешенВвод = Истина;
		РезультатПроверки.Основание    = ТекущиеДанные.Ссылка;
		
		Возврат РезультатПроверки;
		
	Иначе
		
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
			ДанныеСтроки = Элементы.СписокКОформлению.ДанныеСтроки(ВыделеннаяСтрока);
			
			Если ДанныеСтроки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если РезультатПроверки.Основание = Неопределено Тогда
				РезультатПроверки.Основание = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки.Ссылка);
			Иначе
				РезультатПроверки.Основание.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатПроверки.РазрешенВвод = ПроверитьПоКлючевымРеквизитамЕдинообразностьПартий(РезультатПроверки.Основание);
	
	Если Не РезультатПроверки.РазрешенВвод Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Различаются ключевые реквизиты импортируемых партий. Выделенные строки должны быть включены в различные документы Импорта продукции'"),, "СписокКОформлению");
			Возврат РезультатПроверки;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция СписокИмпортируемыхПартийПоОтбору(Организация, МестоХранения, ДатаВвоза)
	
	МассивИмпортируемыхПартий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИмпортируемаяПартияСАТУРНТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИмпортируемаяПартияСАТУРН.Товары КАК ИмпортируемаяПартияСАТУРНТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИмпортируемаяПартияСАТУРН КАК ИмпортируемаяПартияСАТУРН
		|		ПО ИмпортируемаяПартияСАТУРНТовары.Ссылка = ИмпортируемаяПартияСАТУРН.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОформленияДокументовСАТУРН КАК Статусы
		|		ПО ИмпортируемаяПартияСАТУРНТовары.Ссылка = Статусы.Основание
		|ГДЕ
		|	НЕ ИмпортируемаяПартияСАТУРН.ПометкаУдаления
		|	И ИмпортируемаяПартияСАТУРНТовары.ИдентификаторПартии = """"
		|	И Статусы.СтатусОформления В
		|	(ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.НеОформлено),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ОформленоЧастично),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ЕстьОшибкиОформления),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовГосИС.ТребуетсяСопоставлениеНоменклатуры))
		|	И ЕСТЬNULL(Статусы.Архивный, ЛОЖЬ) = ЛОЖЬ
		|	И ИмпортируемаяПартияСАТУРН.ОрганизацияСАТУРН = &ОрганизацияСАТУРН
		|	И ИмпортируемаяПартияСАТУРН.МестоХранения = &МестоХранения
		|	И ИмпортируемаяПартияСАТУРН.ДатаВвоза = &ДатаВвоза";
	
	Запрос.УстановитьПараметр("МестоХранения",     МестоХранения);
	Запрос.УстановитьПараметр("ДатаВвоза",         ДатаВвоза);
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивИмпортируемыхПартий.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат МассивИмпортируемыхПартий;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПоКлючевымРеквизитамЕдинообразностьПартий(МассивОснований)
	
	РазрешеноОбъединение = Ложь;
	
	ТаблицаОснований = Новый ТаблицаЗначений;
	ТаблицаОснований.Колонки.Добавить("Ссылка", Метаданные.ОпределяемыеТипы.ОснованиеИмпортПродукцииСАТУРН.Тип);
	
	Для Каждого Основание Из МассивОснований Цикл
		
		НоваяСтрокаОснований        = ТаблицаОснований.Добавить();
		НоваяСтрокаОснований.Ссылка = Основание;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаОснований.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ТаблицаОснований
		|ИЗ
		|	&ТаблицаОснований КАК ТаблицаОснований
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИмпортируемаяПартияСАТУРН.Ссылка ЕСТЬ NULL                          КАК ЭтоПрикладнойДокумент,
		|	ЕСТЬNULL(ИмпортируемаяПартияСАТУРН.ОрганизацияСАТУРН, НЕОПРЕДЕЛЕНО) КАК ОрганизацияСАТУРН,
		|	ЕСТЬNULL(ИмпортируемаяПартияСАТУРН.МестоХранения, НЕОПРЕДЕЛЕНО)     КАК МестоХранения,
		|	ЕСТЬNULL(ИмпортируемаяПартияСАТУРН.ДатаВвоза, НЕОПРЕДЕЛЕНО)         КАК ДатаВвоза
		|ИЗ
		|	ВТ_ТаблицаОснований КАК ВТ_ТаблицаОснований
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИмпортируемаяПартияСАТУРН КАК ИмпортируемаяПартияСАТУРН
		|		ПО ВТ_ТаблицаОснований.Ссылка = ИмпортируемаяПартияСАТУРН.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаОснований", ТаблицаОснований);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РазрешеноОбъединение = (ВыборкаДетальныеЗаписи.Количество() = 1);
	
	Возврат РазрешеноОбъединение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
